//- Дано натуральное число n. Выведите все числа от 1 до n.

// let SomeNmb = (n) => {
//     let number = [];
//     for (let i = 1; i <= n; i++) {
//         number.push(i);
//     }
//     return number;
// }
// console.log(SomeNmb(6));


//- Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

// let AllNumb = (a, b) => {
//     if (a < b) {
//         for (let i = a; i < b; i++) {
//             console.log(i);
//         }
//     } else if (a > b) {
//         for (let i = a; i > b; i--) {
//             console.log(i)
//         }
//     }
// }
// AllNumb(22, 77);


//-   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

