// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 3) {
//     console.log('large array');
// } else {
//     console.log('small array')
// }




// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let a = 25;
// let b = 22;
// let c = 30;
// if (b > a && b < c) {
//     console.log(b);
// } else if (a > b && a < c) {
//     console.log(a);
// } else if (c > b && c < a) {
//     console.log(c);
// }




// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

//
// let a = 4;
// let b = 5;
// (a + b < 4) ? console.log('багато') : console.log('мало');




// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let nmb = prompt('number');
// if (nmb >= -100 && nmb < 0) {
//     console.log('---');
// } else if (nmb == 0) {
//     console.log('zero');
// } else if (nmb > 0 && nmb <= 100) {
//     console.log('+++')
// }else {
//     console.log('error')
// }