// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)


// let nmb1 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i=0;
// while (i<nmb1.length){
//     let numberOne = nmb1[i];
//     i++;
//     console.log(numberOne);
// }


// let nmb2 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = 0; i < nmb2.length; i++) {
//     let nmb2Element = nmb2[i];
//     console.log(nmb2Element);
// }

// let nmb3 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// i = 0;
// while (i < nmb3.length) {
//     i++;
//     if (i % 2 !== 1) {
//         console.log(nmb3[i]);
//     }
// }

// let nmb4 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = 0; i < nmb4.length; i++) {
//     if (i % 2 !== 0) {
//         console.log(nmb4[i]);
//     }
// }